html/org-pages/qc/week0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-18 Thu 20:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 0 - Notes</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="Week 0 - Notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 0 - Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9b3c9a2">Week 0 (Qubit by Qubit)</a>
<ul>
<li><a href="#org32ebdae">Quantum Computing</a></li>
<li><a href="#orge0dd523">Quantum Mechanics</a></li>
<li><a href="#orgb8aa1cc">The 3 main phenomena</a></li>
<li><a href="#org0115180">Applications of Quantum Computing</a></li>
<li><a href="#org30a7121">Quantum Computers posses advantages in</a></li>
<li><a href="#orgc4977a3">The bigger field</a></li>
<li><a href="#orgf024951">Universities (US/UK)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9b3c9a2" class="outline-2">
<h2 id="org9b3c9a2">Week 0 (Qubit by Qubit)</h2>
<div class="outline-text-2" id="text-org9b3c9a2">
<ul class="org-ul">
<li>As this is the first week of the intire course, we had plenty of introduction to the course logistics, so I will make notes about the <b>content</b> given only.</li>
</ul>
</div>

<div id="outline-container-org32ebdae" class="outline-3">
<h3 id="org32ebdae">Quantum Computing</h3>
<div class="outline-text-3" id="text-org32ebdae">
<ul class="org-ul">
<li>A quantum computer uses properties of quantum mechanics to solve problems (just like a classical computer would do, except for this we use classical physics)</li>
</ul>
</div>
</div>

<div id="outline-container-orge0dd523" class="outline-3">
<h3 id="orge0dd523">Quantum Mechanics</h3>
<div class="outline-text-3" id="text-orge0dd523">
<ul class="org-ul">
<li>It describes how really small objects (AKA quantum objects like atoms and subatomic particles) behave.</li>
<li>In the quantum world, plenty of strange things can happen: Objects can be in multiple places (superposition), Objects can pass through physical barriers (tunneling), Information can be teleported (teleportation).</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8aa1cc" class="outline-3">
<h3 id="orgb8aa1cc">The 3 main phenomena</h3>
<div class="outline-text-3" id="text-orgb8aa1cc">
<ul class="org-ul">
<li>Superposition, Interference, Entanglement
<ul class="org-ul">
<li>These are the 3 quantum phenomena that allow us to design quantum algorithms.</li>
</ul></li>
<li>This field is all about mastering these properties to make computing faster and more powerful.</li>
</ul>
</div>
</div>

<div id="outline-container-org0115180" class="outline-3">
<h3 id="org0115180">Applications of Quantum Computing</h3>
<div class="outline-text-3" id="text-org0115180">
<ul class="org-ul">
<li>Saving lives - Climate change is a threat.</li>
<li>Globally distributing food - &ldquo;Could Quantum Computing Help Feed the World?&rdquo;</li>
<li>Astrophysics - Search for life in other planets</li>
<li>Vaccine developtment, Drug Discovery - Simulating quantum systems
<ul class="org-ul">
<li>Finance</li>
<li>Cyber Security</li>
<li>Biology</li>
<li>Chemestry</li>
<li>Aerospace</li>
<li>Robotics and Machine Learning</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org30a7121" class="outline-3">
<h3 id="org30a7121">Quantum Computers posses advantages in</h3>
<div class="outline-text-3" id="text-org30a7121">
<ul class="org-ul">
<li>Problems that involve too much searching or testing for classical computers to do quickly</li>
<li>Problems that require secure encryption</li>
<li>Problems that require simulating quantum mechanical systems</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4977a3" class="outline-3">
<h3 id="orgc4977a3">The bigger field</h3>
<div class="outline-text-3" id="text-orgc4977a3">
<ul class="org-ul">
<li>Quantum Computing is part of a larger field called Quantum Information Science and Engineering (QISE)
<ul class="org-ul">
<li>Quantum computing, Quantum sensing, Quantum networking</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf024951" class="outline-3">
<h3 id="orgf024951">Universities (US/UK)</h3>
<div class="outline-text-3" id="text-orgf024951">
<ul class="org-ul">
<li>Search about &ldquo;The Quantum talent gap&rdquo;
<ul class="org-ul">
<li>The Institute for Quantum Computing — University of Waterloo</li>
<li>University of Oxford</li>
<li>Centre for Quantum Information and Foundations - Cambridge</li>
<li>University of California Berkeley</li>
<li>University of Maryland — Joint Quantum Institute</li>
<li>University of Science and Technology of China (USTC) – Division of Quantum Physics and Quantum Information</li>
<li>University of Chicago — Chicago Quantum Exchange (CQE)</li>
<li>Harvard University — Harvard Quantum Initiative</li>
<li>MIT — Center for Theoretical Physics</li>
<li>Unversity of California Riverside</li>
<li><a href="https://quantumcomputingreport.com/universities/">&ldquo;Quantum Universities&rdquo;</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2021-11-18 Thu 20:31</p>
</div>
</body>
</html>
